In [145]:
import pandas as pd

Two Main Datatypes

In [146]:
series = pd.Series(["BMW", "Toyota", "Honda"])

In [147]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

Series = 1-Dimensional

In [148]:
colors = pd.Series(["Red", "Blue", "White"])
colors

0      Red
1     Blue
2    White
dtype: object

Now we'll make a Dataframe, which can be multidimensional

In [149]:
car_data = pd.DataFrame({"Car Make": series, "Color": colors })
car_data.head()

  Car Make  Color
0      BMW    Red
1   Toyota   Blue
2    Honda  White

now we'll import data instead of just creating it

In [150]:
gas_prices = pd.read_csv("daily_gas_prices.csv")

In [151]:
car_sales = pd.read_csv("car-sales.csv")

## Describing Data

In [152]:
#attribute, which give meta information about a dataframe
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [153]:
car_columns = car_sales.columns
car_columns[1]

car_sales.describe()
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [154]:
gas_prices.sum()
len(gas_prices)

5953

## Viewing and Selecting Data

In [155]:
#.loc and .iloc
animals = pd.Series(["cat", "dog", "bird", "panda", "snake"], index=[0,3,9,3,8])
animals.loc[3]

3      dog
3    panda
dtype: object

In [156]:
animals.iloc[3]
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [157]:
car_sales[(car_sales.Make == "Toyota") & (car_sales.Colour == "White")]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
8  Toyota  White          60000      4  $6,250.00

In [158]:
pd.crosstab(car_sales.Make, car_sales.Doors)

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

Comparing more than two columns

In [159]:
#groupby
car_sales.groupby(["Make"]).mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [160]:
car_sales[(car_sales.Make == "Toyota") & (car_sales.Colour == "White")].groupby(["Make"]).mean()

        Odometer (KM)  Doors
Make
Toyota       105021.5    4.0

In [161]:
car_sales.Price = car_sales["Price"].replace('\D', '', regex=True).astype(int).apply(lambda x: x / 100)
car_sales.Price

0     4000.0
1     5000.0
2     7000.0
3    22000.0
4     3500.0
5     4500.0
6     7500.0
7     7000.0
8     6250.0
9     9700.0
Name: Price, dtype: float64

## Manipulating Data

In [162]:
#car_sales.Make.str.lower()
missing_car_sales_data = pd.read_csv("car-sales-missing-data.csv")
missing_car_sales_data["Odometer"].fillna(missing_car_sales_data.Odometer.mean(), inplace = True)
missing_car_sales_data.Price.fillna(0, inplace=True)
missing_car_sales_data.Doors.fillna(5, inplace=True)
missing_car_sales_data.Price = missing_car_sales_data["Price"].replace('\D', '', regex=True).astype(int).apply(lambda x: x / 100)

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   4000.0
1   Honda    Red          87899      4   5000.0
2  Toyota   Blue          32549      3   7000.0
3     BMW  Black          11179      5  22000.0
4  Nissan  White         213095      4   3500.0
5  Toyota  Green          99213      4   4500.0
6   Honda   Blue          45698      4   7500.0
7   Honda   Blue          54738      4   7000.0
8  Toyota  White          60000      4   6250.0
9  Nissan  White          31600      4   9700.0

In [176]:
car_sales["Seats"] = pd.Series([5,5,5,5])
car_sales.Seats.fillna(5,inplace=True)

In [181]:
#getting a random 20% subset of the dataset
car_rand_sample = car_sales.sample(frac=0.2)

In [193]:
#if we want to reset the index
#the drop flag prevents the addition of a new index column
car_rand_sample.reset_index(inplace=True, drop=True)
car_rand_sample

     Make Colour  Odometer (KM)  Doors   Price  Seats
0   Honda    Red          87899      4  5000.0    5.0
1  Toyota   Blue          32549      3  7000.0    5.0